#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.aws_iam_policy_document.assume_role: Reading...
aws_eip.eip_01: Refreshing state... [id=eipalloc-0b14c2410771b71e7]
aws_vpc.vpc: Refreshing state... [id=vpc-04ab05990fc02a7b9]
aws_iam_role.iam_role_eks_node_group: Refreshing state... [id=earth-dev-eks-node-group-role]
data.aws_iam_policy_document.assume_role: Read complete after 0s [id=3552664922]
aws_eip.eip_02: Refreshing state... [id=eipalloc-04ae2173926c84895]
aws_iam_role.iam_role_eks: Refreshing state... [id=earth-dev-eks-cluster-role]
aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy: Refreshing state... [id=earth-dev-eks-node-group-role-20231011064045713700000001]
aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy: Refreshing state... [id=earth-dev-eks-node-group-role-20231011064045850900000003]
aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=earth-dev-eks-node-group-role-20231011064045836000000002]
aws_iam_role_policy_attachment.AmazonEKSVPCResourceController: Refreshing state... [id=earth-dev-eks-cluster-role-20231011060543488100000002]
aws_iam_role_policy_attachment.AmazonEKSClusterPolicy: Refreshing state... [id=earth-dev-eks-cluster-role-20231011060543415100000001]
aws_subnet.private_subnet_01: Refreshing state... [id=subnet-0dc6390f79098f47a]
aws_subnet.public_subnet_01: Refreshing state... [id=subnet-00f68a80b8ab2e425]
aws_security_group.cluster_sg: Refreshing state... [id=sg-0664b54ff477ec6ae]
aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-07add93cddb2fbf3a]
aws_subnet.public_subnet_02: Refreshing state... [id=subnet-0acb089d1881a68ed]
aws_subnet.private_subnet_02: Refreshing state... [id=subnet-0551b3caa7c364c30]
aws_route_table.public_route_table: Refreshing state... [id=rtb-0568a703a500fb4d5]
aws_nat_gateway.nat_gateway_01: Refreshing state... [id=nat-06d8dbc13b1edf965]
aws_nat_gateway.nat_gateway_02: Refreshing state... [id=nat-0b9bdeb07e8d73a1f]
aws_eks_cluster.eks_cluster: Refreshing state... [id=earth-dev]
aws_route_table.private_route_table_01: Refreshing state... [id=rtb-05a400293669cee93]
aws_route_table_association.route_table_association_p01: Refreshing state... [id=rtbassoc-0a4a8f7b5faf2dbfb]
aws_route_table_association.route_table_association_p02: Refreshing state... [id=rtbassoc-051e83ca71698c6e4]
aws_route_table.private_route_table_02: Refreshing state... [id=rtb-026eb8b5a2455b12c]
aws_route_table_association.route_table_association_i01: Refreshing state... [id=rtbassoc-085105d3835db6e0f]
aws_route_table_association.route_table_association_i02: Refreshing state... [id=rtbassoc-053921ad670d4bb65]
aws_eks_node_group.app_node_group: Refreshing state... [id=earth-dev:app-node-group]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eks_node_group.app_node_group is tainted, so must be replaced
-/+ resource "aws_eks_node_group" "app_node_group" {
      ~ ami_type               = "CUSTOM" -> (known after apply)
      ~ arn                    = "arn:aws:eks:ap-northeast-2:318374019075:nodegroup/earth-dev/app-node-group/14c58ebb-b383-fc99-d1dd-2de7a3666a22" -> (known after apply)
      ~ capacity_type          = "ON_DEMAND" -> (known after apply)
      ~ disk_size              = 0 -> (known after apply)
      ~ id                     = "earth-dev:app-node-group" -> (known after apply)
      ~ instance_types         = [] -> (known after apply)
      - labels                 = {} -> null
      + node_group_name_prefix = (known after apply)
      ~ release_version        = "ami-0e581dc33f688a5df" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-app-node-group-14c58ebb-b383-fc99-d1dd-2de7a3666a22"
                    },
                ]
              - remote_access_security_group_id = ""
            },
        ] -> (known after apply)
      ~ status                 = "CREATE_FAILED" -> (known after apply)
      - tags                   = {} -> null
      + version                = (known after apply)
        # (5 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-074722705350fe8a1"
          ~ name    = "mountpoint-s3" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ update_config {
          - max_unavailable_percentage = 0 -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_iam_role_policy.iam_role_policy_s3 will be created
  + resource "aws_iam_role_policy" "iam_role_policy_s3" {
      + id     = (known after apply)
      + name   = "s3_policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:ap-northeast-2:318374019075:eks-share",
                        ]
                      + Sid      = "MountpointFullBucketAccess"
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:PutObject",
                          + "s3:AbortMultipartUpload",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:ap-northeast-2:318374019075:eks-share/*",
                        ]
                      + Sid      = "MountpointFullObjectAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = "earth-dev-eks-node-group-role"
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @jonghak-dev, Action: `pull_request`, Workflow: `Terraform apply`*